Revit 2027 API
RoutingPreferenceRule.AddCriterion Method
 Adds a new routing criterion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddCriterion(
	RoutingCriterionBase myCriterion
)
Public Sub AddCriterion (
	myCriterion As RoutingCriterionBase
)
public:
void AddCriterion(
	RoutingCriterionBase^ myCriterion
)
member AddCriterion :
        myCriterion : RoutingCriterionBase -> unit
Parameters
myCriterion RoutingCriterionBase
 The criterion to add.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace